app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id], :include => [ :moves ])
---
SELECT "moves".* FROM "moves" WHERE ("moves".game_id = 953125641)
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "uuid", "updated_at", "active") VALUES('2010-03-28 18:29:02', NULL, '2010-03-28 18:29:02', NULL)

  def update
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)
DELETE FROM "games" WHERE "id" = 953125641