app/controllers/moves_controller.rb

  def index
    @moves = Move.all
---
SELECT * FROM "moves"

  def show
    @move = Move.find(params[:id])
---
SELECT * FROM "moves" WHERE ("moves"."id" = 953125641)

  def edit
    @move = Move.find(params[:id])
---
SELECT * FROM "moves" WHERE ("moves"."id" = 953125641)

  def create
    @move = Move.new(params[:move])

    respond_to do |format|
      if @move.save
---
INSERT INTO "moves" ("angle", "created_at", "x", "y", "updated_at", "power", "attempt_failed", "game_id", "attempts", "score_differential", "max_multiplier") VALUES(1.0, '2010-03-28 22:25:40', 1.0, 1.0, '2010-03-28 22:25:40', 1.0, NULL, 1, 1, 0, 1)

  def update
    @move = Move.find(params[:id])
---
SELECT * FROM "moves" WHERE ("moves"."id" = 953125641)

  def destroy
    @move = Move.find(params[:id])
    @move.destroy
---
SELECT * FROM "moves" WHERE ("moves"."id" = 953125641)
DELETE FROM "moves" WHERE "id" = 953125641