app/controllers/pieces_controller.rb

  def index
    @pieces = Piece.all
---
SELECT * FROM "pieces"

  def show
    @piece = Piece.find(params[:id])
---
SELECT * FROM "pieces" WHERE ("pieces"."id" = 953125641)

  def edit
    @piece = Piece.find(params[:id])
---
SELECT * FROM "pieces" WHERE ("pieces"."id" = 953125641)

  def create
    @piece = Piece.new(params[:piece])

    respond_to do |format|
      if @piece.save
---
INSERT INTO "pieces" ("move_id", "radius", "created_at", "x", "y", "updated_at", "count") VALUES(NULL, NULL, '2010-03-28 18:29:02', NULL, NULL, '2010-03-28 18:29:02', NULL)

  def update
    @piece = Piece.find(params[:id])
---
SELECT * FROM "pieces" WHERE ("pieces"."id" = 953125641)

  def destroy
    @piece = Piece.find(params[:id])
    @piece.destroy
---
SELECT * FROM "pieces" WHERE ("pieces"."id" = 953125641)
DELETE FROM "pieces" WHERE "id" = 953125641